console.log('ADD')
export const yuan = [
    {
        '系别':'电子系',
        '专业':[['汽车制造','电子技术'],{
            '专业':'汽车制造',
            '班级':['制造一班','制造二班'],
            '课程':['工业软件','汽车制造','汽车维修','语文']
        },
        {
            '专业':'电子技术',
            '班级':['电子一班','电子二班'],
            '课程':['电路设计','电子软件','数学','英语']
        }]
    },
    {
        '系别':'软件系',
        '专业':[['软件技术','动漫制作'],
        {
            '专业':'软件技术',
            '班级':['软件一班','软件二班'],
            '课程':['web','java','数据库','linux']
        },
        {
            '专业':'动漫制作',
            '班级':['动漫一班','动漫二班'],
            '课程':['ps技术','动漫制作','网络','美术']
        }]
    },
    {
        '系别':'管理系',
        '专业':[['航空','高铁'],
        {
            '专业':'航空',
            '班级':['航空一班','航空二班'],
            '课程':['形体','化学','生物','物理']
        },
        {
            '专业':'高铁',
            '班级':['高铁一班','高铁二班'],
            '课程':['行政管理','政治','历史','地理']
        }]
    }
]


export function add(){
    // console.log('1232')
    return {
        type:'ADD',
        data:yuan
    }
}